tests/load/auth-flow.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 10
      name: "Authenticated flow test"
  defaults:
    headers:
      Content-Type: "application/json"
  variables:
    loginEmail: "admin@chancehr.com"
    loginPassword: "test1234"
    workplaceId: "1"

scenarios:
  - name: "Full authenticated flow"
    flow:
      # 1. 로그인하여 토큰 획득
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ loginEmail }}"
            password: "{{ loginPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

      # 2. 인증된 상태로 직원 목록 조회
      - get:
          url: "/api/employees/workplace/{{ workplaceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 3. 급여 계산 API 호출
      - post:
          url: "/api/salary/calculate-insurance"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            salary: 3000000
          expect:
            - statusCode: 200

      # 4. 푸시 공개키 조회 (비인증 API)
      - get:
          url: "/api/push/public-key"
          expect:
            - statusCode: 200